snlkuharlocal/src/ExchangePlans/ОбменС77/ОбменС77.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="46e0e5e3-ebe1-46cd-b157-370fb2e50c14">
  <name>ОбменС77</name>
  <attributes>
    <name>ИДИнформационнойБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДИнформационногоПространства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СхемаОбменаСУзлом</name>
    <type>
      <types>EnumRef.СхемыОбмена77</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресОбмена</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Переключатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаПравил</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаВыгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодИБ_77</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогЗагрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ_77</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВнешнююОбработкуОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоОтгруженные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьОбменДокументами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ExchangePlan>

snlkuharlocal/src/Enums/ВидыОплаты/ВидыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОплаты</name>
  <enumValues>
    <name>НАЛ</name>
    <comment>Наличные</comment>
  </enumValues>
  <enumValues>
    <name>БН</name>
    <comment>Без нал</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыСообщенийЛога/ТипыСообщенийЛога.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСообщенийЛога</name>
  <enumValues>
    <name>Информация</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СхемыОбмена77/СхемыОбмена77.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СхемыОбмена77</name>
  <enumValues>
    <name>ВыгрузкаДокументов</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаСправочников</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/ExchangePlans/ОбменС77/ObjectModule.bsl
Функция ПолучитьТаблицуИзмененныхОбъектов()	
	// Создаем объект записи XML
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	
		// Создаем новое сообщение
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, Ссылка);
		
	НомерСообщения = ЗаписьСообщения.НомерСообщения;	
	
	ТИ=Новый ТаблицаЗначений;
	
	ТИ.Колонки.Добавить("Тип");
	ТИ.Колонки.Добавить("Вид");
	ТИ.Колонки.Добавить("Период");
	ТИ.Колонки.Добавить("Объект");
	
	// Получаем выборку изменённых данных
	Счетчик = 0;
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, НомерСообщения);
	Пока ВыборкаИзменений.Следующий() Цикл		
		ОбработкаПрерыванияПользователя();
		
		Данные = ВыборкаИзменений.Получить();		

		Счетчик = Счетчик + 1;
		Состояние("Выгрузка данных: " + Строка(Счетчик));		
		
		ТипОбъекта		= ТипОбъекта(Данные);
		//
		//Если ТипОбъекта="Документ" Тогда
		//	Если Данные.ИБ<>ИБ_77 Тогда Продолжить КонецЕсли; 		
		//ИначеЕсли ТипОбъекта="Справочник" Тогда
		//	Вид=Данные.Метаданные().Имя;
		//	Если Вид="Контрагенты" Тогда
		//		Если Данные.Владелец<>ИБ_77 Тогда Продолжить КонецЕсли;
		//	ИначеЕсли Вид="Договоры" Тогда
		//		Если Данные.Владелец.Владелец<>ИБ_77 Тогда Продолжить КонецЕсли;				
		//	КонецЕсли; 			
		//КонецЕсли; 
		
		СтрокаТИ		= ТИ.Добавить();
		СтрокаТИ.Тип	= ТипОбъекта(Данные);
		Если СтрокаТИ.Тип="Справочник" ИЛИ СтрокаТИ.Тип="Документ" Тогда			
			СтрокаТИ.Вид	= Данные.Метаданные().Имя;		
			СтрокаТИ.Объект	= Данные.Ссылка;	
			Если СтрокаТИ.Тип="Документ" Тогда
				СтрокаТИ.Период=Данные.Дата;			
			КонецЕсли; 
		Иначе
			СтрокаТИ.Объект=Данные;	
		КонецЕсли;		
	КонецЦикла;
	
	ЗаписьСообщения.ЗакончитьЗапись();
	ЗаписьXML.Закрыть();		
	
	ТИ.Сортировать("Тип,Вид,Период");	
	Возврат Новый Структура("НомерСообщения,ТИ",НомерСообщения,ТИ);
КонецФункции

Функция ПолучитьИмяПравила(Объект)
	Тип=ТипОбъекта(Объект);
	Если Тип<>"Документ" И Тип<>"Справочник" Тогда Возврат "" КонецЕсли; 
	
	Вид=Объект.Метаданные().Имя;
	
	ИмяПравила=Вид;
	
	Если Тип="Документ" Тогда
		Если Вид="РасходнаяНакладная" Тогда
			Если Объект.ВидОплаты=Перечисления.ВидыОплаты.НАЛ Тогда
				ИмяПравила="РасходнаяНал";
			Иначе				
				ИмяПравила="РасходнаяБН";			
			КонецЕсли;		
		КонецЕсли; 		
	КонецЕсли;
	
	Возврат ИмяПравила;
КонецФункции // ПоучитьИмяПравиля()

//формирование только квитанции о приеме //подтверждения//
Функция ЗаписатьСообщениеВФормате77() Экспорт		
	ЭтотУзел=ПолучитьЭтотУзел(Ссылка);
	
	ИмяФайлаСообщения=АдресОбмена+"1Cv77Chs.dat";
	Текст=Новый ЗаписьТекста(ИмяФайлаСообщения,КодировкаТекста.ANSI,,Ложь);	
	
	СтрНомерОтправленного	=СокрЛП(Формат(НомерОтправленного,"ЧГ="));
	СтрНомерПринятого		=СокрЛП(Формат(НомерПринятого,"ЧГ="));	
	
	Код77_ЭтогоУзла			=?(ПустаяСтрока(ЭтотУзел.КодИБ_77),ЭтотУзел.Код,ЭтотУзел.КодИБ_77);
	
	Текст.ЗаписатьСтроку("");
	Текст.ЗаписатьСтроку("{"+ЭтотУзел.ИДИнформационногоПространства+","""+Код+""","+ИДИнформационнойБазы+","""+Код77_ЭтогоУзла+""","+ЭтотУзел.ИДИнформационнойБазы+","""+СтрНомерОтправленного+"|"+Код77_ЭтогоУзла+""",");	
	Текст.ЗаписатьСтроку("{""Acknowledgements"",");
	Текст.ЗаписатьСтроку("{"""+СтрНомерПринятого+"|"+Код+"""}},");
	Текст.ЗаписатьСтроку("{""Constants""},");
	Текст.ЗаписатьСтроку("{""References""},");
	Текст.ЗаписатьСтроку("{""Documents""},");
	Текст.ЗаписатьСтроку("{""Calendars""},");
	Текст.ЗаписатьСтроку("{""Deleted References""},");
	Текст.ЗаписатьСтроку("{""Deleted Documents""}}");
	
	Текст.Закрыть();
	
	ИмяФайлаКвитанции=АдресОбмена+"1Cv77Dld.id";
		
	Текст=Новый ЗаписьТекста(ИмяФайлаКвитанции,КодировкаТекста.OEM,,Ложь);	
	Текст.ЗаписатьСтроку("");
	Текст.Записать("{""Download ID"","+ЭтотУзел.ИДИнформационногоПространства+","""+Код77_ЭтогоУзла+""","+ЭтотУзел.ИДИнформационнойБазы+","""+Код+""","+ИДИнформационнойБазы+","""+СтрНомерОтправленного+"|"+Код77_ЭтогоУзла+"""}");
	Текст.Закрыть();	
	
	Архив=Новый ЗаписьZipФайла(АдресОбмена+Код77_ЭтогоУзла+"1.zip",,,МетодСжатияZIP.Сжатие,УровеньСжатияZIP.Минимальный);
	Архив.Добавить(ИмяФайлаСообщения);
	Архив.Добавить(ИмяФайлаКвитанции);
	
	Архив.Записать();
	
	УдалитьФайлы(ИмяФайлаСообщения);
	УдалитьФайлы(ИмяФайлаКвитанции);
	
	Возврат НомерОтправленного+1;
КонецФункции

Функция ЗаписатьСообщениеВФормате80(ИмяФайла)
	ИзмененнныеОбъекты=ПолучитьТаблицуИзмененныхОбъектов();
	
	НомерСообщения	=ИзмененнныеОбъекты.НомерСообщения;
	ТИ				=ИзмененнныеОбъекты.ТИ;
	
	ТО=Новый ТаблицаЗначений;
	ТО.Колонки.Добавить("ИмяПравила");
	ТО.Колонки.Добавить("МассивДанных");
	
	СтрокаТО=Неопределено;
	
	Для Каждого СтрокаТИ ИЗ ТИ Цикл
		Если СтрокаТИ.Тип="Документ" И (СтрокаТИ.Объект.Дата<НачалоДня(ДатаНачалаВыгрузки)) Тогда //документ не в интервале
			Продолжить;		
		КонецЕсли; 
		
		ИмяПравила=ПолучитьИмяПравила(СтрокаТИ.Объект);
		
		Если СтрокаТО=Неопределено ИЛИ СтрокаТО.ИмяПравила<>ИмяПравила Тогда		
			СтрокаТО=ТО.Найти(ИмяПравила,"ИмяПравила");
			Если СтрокаТО=Неопределено Тогда
				СтрокаТО=ТО.Добавить();
				СтрокаТО.ИмяПравила=ИмяПравила;
				СтрокаТО.МассивДанных=Новый Массив;
			КонецЕсли; 
		КонецЕсли;	
		
		СтрокаТО.МассивДанных.Добавить(СтрокаТИ.Объект);	
	КонецЦикла; 
	
	Для Каждого СтрокаТО Из ТО Цикл
		Сообщить(""+СтрокаТО.ИмяПравила+" "+(СтрокаТО.МассивДанных.ВГраница()+1));	
	КонецЦикла; 
	
	Если ИспользоватьВнешнююОбработкуОбмена Тогда
		ОбработкаВыгрузки=ВнешниеОбработки.Создать(Константы.КаталогВнешнихОтчетов.Получить()+"УниверсальныйОбменДаннымиXML.epf");
	Иначе
		ОбработкаВыгрузки=Обработки.УниверсальныйОбменДаннымиXML.Создать();
	КонецЕсли;
	
	ТП=Новый ТаблицаЗначений;
	ТП.Колонки.Добавить("Имя");
	ТП.Колонки.Добавить("Значение");
	
	СтрокаТП=ТП.Добавить();	
	СтрокаТП.Имя		= "MessageNo";
	СтрокаТП.Значение	= НомерСообщения;	
	
	СтрокаТП=ТП.Добавить();
	СтрокаТП.Имя		= "From";
	СтрокаТП.Значение	= ПланыОбмена.ОбменС77.ЭтотУзел().Код;	
	
	СтрокаТП=ТП.Добавить();
	СтрокаТП.Имя		= "To";
	СтрокаТП.Значение	= Код;	
	
	СтрокаТП=ТП.Добавить();
	СтрокаТП.Имя		= "ИБПолучатель";
	СтрокаТП.Значение	= ИБ_77.Код;
	
	ОбработкаВыгрузки.ИмяФайлаОбмена						= ИмяФайла;
	ОбработкаВыгрузки.ИмяФайлаПравилОбмена  				= ИмяФайлаПравил;
	ОбработкаВыгрузки.ФлагКомментироватьОбработкуОбъектов	= Ложь;
	
	ОбработкаВыгрузки.ВыполнитьВыгрузку(ТО,ТП);	
	
	Возврат НомерСообщения;	
КонецФункции

Функция ЗаписатьСообщениеСИзменениями() Экспорт	
	ЭтотУзел=ПланыОбмена.ОбменС77.ЭтотУзел();
	
	// Формируем имя временного файла
	ИмяФайла = КаталогВременныхФайлов() + "\" + ПолучитьИмяФайлаОбмена(ЭтотУзел, Ссылка, "_W");
			   
	ЗаписатьВЛог(""+Ссылка.Метаданные().Имя,"Начало выгрузки в узел: "+Ссылка.Код,Перечисления.ТипыСообщенийЛога.Информация);
	
	
	// Записываем новое сообщение обмена в файл
	Если СхемаОбменаСУзлом=Перечисления.СхемыОбмена77.ВыгрузкаДокументов Тогда
		НомерСообщения 		= ЗаписатьСообщениеВФормате80(ИмяФайла);
		РезультатОтправки	= ОтправитьФайлОбмена(ИмяФайла,НомерСообщения,Ссылка,Ложь);		
	ИначеЕсли СхемаОбменаСУзлом=Перечисления.СхемыОбмена77.ЗагрузкаСправочников Тогда		
		НомерОтправленного	= ЗаписатьСообщениеВФормате77();
		Записать();
	КонецЕсли;
	
	ЗаписатьВЛог(""+Ссылка.Метаданные().Имя,"Конец выгрузки в узел: "+Ссылка.Код,Перечисления.ТипыСообщенийЛога.Информация);	
	
	Возврат РезультатОтправки;
КонецФункции// ЗаписатьСообщениеСИзменениями()


Функция ПрочитатьСообщениеВФормате80(ИмяФайла)
    ЧтениеXML=Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
	
	ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
	ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
	
	НомерСообщения	 				= ЧтениеСообщения.НомерСообщения;
	ПараметрыСеанса.НомерСообщения	= НомерСообщения;
	
	Если ЧтениеСообщения.Отправитель <> Ссылка Тогда		
		// Сообщение предназначено не для этого узла
		ВызватьИсключение "Неверный узел";		
	КонецЕсли;	
	// Удаляем регистрацию изменений для узла отправителя сообщения
	// по номеру принятого сообщения, полученного из сообщения
	ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);
	
	Сообщить("Отправитель: "+ЧтениеСообщения.Отправитель+", № принятого: "+ЧтениеСообщения.НомерПринятого+", № сообщения: "+ЧтениеСообщения.НомерСообщения);		
	
	Если ЧтениеXML.ТипУзла=ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя="NotLoaded" Тогда		
		ЧтениеXML.Прочитать();
			
		Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл
			СсылкаНаОбъект=ПрочитатьXML(ЧтениеXML);			
			Сообщить(СсылкаНаОбъект);		
		КонецЦикла;			
		
		ЧтениеXML.Прочитать();
	КонецЕсли;		
		
    ЧтениеСообщения.ЗакончитьЧтение();
	
	Возврат НомерСообщения;
КонецФункции

Функция ПрочитатьСообщениеВФормате77(ИмяФайла)
	
	Если ИспользоватьВнешнююОбработкуОбмена Тогда
		ОбработкаОбмена=ВнешниеОбработки.Создать(Константы.КаталогВнешнихОтчетов.Получить()+"УниверсальныйОбменДаннымиXML.epf");		
	Иначе
		ОбработкаОбмена=Обработки.УниверсальныйОбменДаннымиXML.Создать();
	КонецЕсли;	
	
	ОбработкаОбмена.ИмяФайлаОбмена=ИмяФайла;
	ОбработкаОбмена.РежимОбмена	="Загрузка";
	Результат					=ОбработкаОбмена.ВыполнитьЗагрузку(Истина);	
	Если Результат.Результат Тогда
		Возврат Результат.НомерСообщения;	
	Иначе
		Возврат Неопределено;	
	КонецЕсли; 
КонецФункции

Функция ПрочитатьНовоеСообщение(ИмяФайла)
	Если СхемаОбменаСУзлом=Перечисления.СхемыОбмена77.ВыгрузкаДокументов Тогда
		Возврат ПрочитатьСообщениеВФормате80(ИмяФайла);
	ИначеЕсли СхемаОбменаСУзлом=Перечисления.СхемыОбмена77.ЗагрузкаСправочников Тогда
		Возврат ПрочитатьСообщениеВФормате77(ИмяФайла);	
	КонецЕсли;	
КонецФункции // ПрочитатьНовоеСообщение()

Функция ПрочитатьСообщениеСИзменениями(Контроль=Ложь,ПротЗагр=Ложь) Экспорт	
	Перем НомерСообщения;	// Номер принимаемого сообщения
	
	ЭтотУзел=ПланыОбмена.ОбменС77.ЭтотУзел();
	
	// Формируем имя временного файла
	ИмяФайла = КаталогВременныхФайлов() + ПолучитьИмяФайлаОбмена(ЭтотУзел, Ссылка, "_R");	
	
	ЗаписатьВЛог(Ссылка.Метаданные().Имя,"Загрузка из: " + Код,Перечисления.ТипыСообщенийЛога.Информация);	
	
	ФайлПолучен=ПолучитьФайлОбмена(ИмяФайла,Ссылка,Ложь);
	
	Результат=Новый Структура("Результат,Описание");
	
	Если ФайлПолучен Тогда		
		Попытка			
			// Читаем полученное сообщение из файла	
			НомерСообщения = ПрочитатьНовоеСообщение(ИмяФайла);
			
			//ПротЗагр=ЗагруженныеДокументы;
			Сообщить("Прочитано сообщение №: "+НомерСообщения);
			
			Результат.Вставить("Результат",Истина);
			Результат.Вставить("Описание","Выполнена загрузка");
		Исключение			
			ЗаписатьВЛог("ОбменДаннымиОсновной","Ошибка получения сообщения ! Отправитель: "+Код+". "+ОписаниеОшибки(),Перечисления.ТипыСообщенийЛога.Ошибка,Истина);
			
			Результат.Вставить("Результат",Ложь);
			Результат.Вставить("Описание","Ошибка загрузки ! "+ОписаниеОшибки());
		КонецПопытки;
		
		Если НомерСообщения <> Неопределено Тогда			
			// Удаляем файлы со старыми сообщениями обмена
			УдалитьФайлыОбмена(НомерСообщения,Ссылка); 			
		КонецЕсли;		
	Иначе
		ЗаписатьВЛог(Ссылка.Метаданные().Имя,"Нет сообщений из: " + Код,Перечисления.ТипыСообщенийЛога.Информация);
		
		Результат.Вставить("Результат",Ложь);
		Результат.Вставить("Описание","Нет сообщений !");
	КонецЕсли;
	
	Попытка		
		// Удаляем файл с сообщением обмена
		УдалитьФайлы(ИмяФайла);		
	Исключение
		ЗаписатьВЛог(Ссылка.Метаданные().Имя,"Ошибка удаления полученных файлов ! Отправитель: " + Код,Перечисления.ТипыСообщенийЛога.Ошибка);	
	КонецПопытки;
	
	ЗаписатьВЛог(Ссылка.Метаданные().Имя,"Конец загрузки из: " + Код,Перечисления.ТипыСообщенийЛога.Информация);	
	
	Если НЕ Результат.Результат Тогда
		Сообщить("Загрузка не выполнена ! Причина: "+Результат.Описание,СтатусСообщения.Информация);
	Иначе
		Если СхемаОбменаСУзлом=Перечисления.СхемыОбмена77.ЗагрузкаСправочников Тогда
			НомерПринятого=НомерСообщения;		
			Записать();		
		КонецЕсли;		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
